namespace task_1
{
    /// <summary>
    /// 1. Написать приложение, проверяющее с помощью регулярного выражения корректность ввода
    /// фамилии и инициалов пользователя в следующем виде: Иванов И.И. либо Иванов ИИ
    /// </summary>
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}