namespace task_2
{
    /// <summary>
    /// 2. Написать приложение, проверяющее с помощью регулярного выражения корректность ввода адреса электронной почты.
    /// Адрес электронной почты должен иметь следующий вид: login@host, где login - последовательность из букв, цифр и
    /// символа "_", начинающаяся с буквы. Длина - от 3 до 16 символов. host - строка вида mail.ru или mail.odessa.ua и т.п. В
    /// конце host должен содержать от 2 до 3 символов (ua, com, net, ru и т.д.)
    /// </summary>
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}