namespace task_3
{
    /// <summary>
    /// 3. Написать приложение, проверяющее с помощью регулярного выражения корректность ввода даты в формате Число-МесяцГод (например, 01-04-2015). 
    /// </summary>
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}